from populate import base
from book.models import Book, Review

titles = ['飛狐外傳',
          '雪山飛狐',
          '連城訣', 
          '天龍八部',
          '射雕英雄傳',
          '白馬嘯西風',
          '鹿鼎記',
          '笑傲江湖',
          '書劍恩仇錄', 
          '神鵰俠侶',
          '俠客行',
          '倚天屠龍記',
          '碧血劍',
          '鴛鴦刀',]
contents = [
    '“胡一刀，曲池，天樞！” “苗人鳳，地倉，合谷！”一個嘶啞的嗓子低沉地叫著。叫聲中充滿著怨毒和憤怒，語聲從牙齒縫中迸出來，似是千年萬年、永恒的咒詛，每一個字音上塗著血和仇恨。...',
    '颼的一聲，一枝羽箭從東邊山坳後射了出來，嗚嗚聲響，劃過長空，穿入一頭飛雁頸中。大雁帶著羽箭在空中打了幾個斤斗，落在雪地。西首數十丈外，四騎馬踏著皚皚白雪，奔馳正急。馬上乘客聽得箭聲，不約而同的一齊勒馬。...',
    '托！托托托！托！托托！兩柄木劍揮舞交斗，相互撞擊，發出托托之聲。有時相隔良久而無聲息，有時撞擊之聲密如聯珠，連綿不絕。那是在湘西沅陵南郊的麻溪鄉下，三間小屋之前，曬谷場上，一對青年男女手持木劍，正在比試。...',
    '青光閃動，一柄青鋼劍倏地刺出，指向在年漢子左肩，使劍少年不等招用老，腕抖劍 斜，劍鋒已削向那漢子右頸。那中年漢子劍擋格，錚的一聲響，雙劍相擊，嗡嗡作聲，震聲 未絕，雙劍劍光霍霍，已拆了三招，中年漢子長劍猛地擊落，直砍少年頂門。那少年避向右 側，左手劍訣一引，青鋼劍疾刺那漢子大腿。...',
    '錢塘江浩浩江水，日日夜夜無窮無盡的從臨安牛家村邊繞過，東流入海。江畔一排數十株烏柏樹，葉子似火燒般紅，正是八月天時。村前村後的野草剛起始變黃，一抹斜陽映照之下，更增了幾分蕭索。兩株大松樹下圍著一堆村民，男男女女和十幾個小孩，正自聚精會神的聽著一個瘦削的老者說話。...',
    '得得得，得得得…………得得得，得得得…………在黃沙莽莽的回疆大漠之上，塵沙飛起兩丈來高，兩騎馬一前一後的急馳而來。前面是匹高腿長身的白馬，馬上騎著個少婦，懷中摟著個七八歲的小姑娘。後面是匹棗紅馬，馬背上伏著的是個高瘦的漢子。...',
    '北風如刀，滿地冰霜。 江南近海濱的一條大路上，一隊清兵手執刀槍，押著七輛囚車，沖風冒寒，向北而行。 前面三輛囚車中分別監禁的是三個男子，都作書生打扮，一個是白發老者，兩個是中年人。後面四輛囚車中坐的是女子，最後一輛囚車中是個少婦，懷中抱著個女嬰，女嬰啼哭不休。...',
    '和風熏柳，花香醉人，正是南國春光漫爛季節。福建省福州府西門大街，青石板路筆 直的伸展出去，直通西門。一座建構宏偉的宅第之前，左右兩座石壇中各豎一根兩丈來高 的旗杆，杆頂飄揚青旗。...',
    '清乾隆十八年六月，陝西扶風延綏鎮總兵衙門內院，一個十四歲的女孩兒跳跳蹦蹦的走 向教書先生書房。上午老師講完了《資治通鑒》上“赤壁之戰”的一段書，隨口講了些諸葛 亮、周瑜的故事。午後本來沒功課，那女孩兒卻興猶未盡，要老師再講三國故事。...',    
    '“越女采蓮秋水畔，窄袖輕羅，暗露雙金釧。照影摘花花似面，芳心只共絲爭亂。 雞尺溪頭風浪晚，霧重煙輕，不見來時伴。隱隱歌聲歸棹遠，離愁引著江南岸。” 一陣輕柔婉轉的歌聲，飄在煙水蒙蒙的湖面上。...',
    '李白這一首“俠客行”古風，寫的是戰國時魏國信陵君門客侯嬴和朱亥的故事，千載之下讀來，英銳之氣，兀自虎虎有威。那大梁城鄰近黃河，後稱汴梁，即今河南開封。...',
    '春游浩蕩，是年年寒食，梨花時節。白錦無紋香爛漫，玉樹瓊苞堆雪。靜夜沉沉，浮光靄靄，冷浸溶溶月。人間天上，爛銀霞照通徹。渾似姑射真人，天姿靈秀，意氣殊高潔。...',
    '大明成祖皇帝永樂六年八月乙未，西南海外浡泥國國王麻那惹加那乃，率同妃子、弟、 妹、世子及陪臣來朝，進貢龍腦、鶴頂、玳瑁、犀角、金銀寶器等諸般物事。成祖皇帝大 悅，嘉勞良久，賜宴奉天門。...',
    '四個勁裝結束的漢子並肩而立，攔在當路！ 若是黑道上山寨的強人，不會只有四個，莫非在這黑沈沈的松林之中，暗中還埋伏下大 批人手？如是剪徑的小賊，見了這麼聲勢浩大的鏢隊，遠避之唯恐不及，哪敢這般大模大樣 的攔路擋道？難到竟是武林高手，沖著自己而來？...',
    ]
authors = '金庸'
publishers = '明河社'
publicationDate = '2018-10-30'
reviews = ['永遠的江湖，永遠的俠客', 
            '借分享',
            '人在江湖飄，哪有不中刀',
            ]
scores = [5, 3, 1]


def populate():
    print('Populating articles and comments ... ', end='')
    Book.objects.all().delete()
    Review.objects.all().delete()

    for title ,content in zip(titles,contents):
        book = Book()
        book.title = title
        book.content = content
        book.author = authors
        book.publisher = publishers
        book.publicationDate  = publicationDate 
        book.price = 999
        book.save()

        for review ,score in zip(reviews,scores):
            Review.objects.create(book=book, review=review, score=score)

    print('done')


if __name__ == '__main__':
    populate()